src/cf/DataProcessors/ОбработкиНалоговИОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОбработкиНалоговИОтчетности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытийКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/КалендарьПодготовкиОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КалендарьПодготовкиОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиКалендаряПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИнформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОбработкиСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВКалендаре</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДляИП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДляООО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеренесенногоОкончанияСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСобытияДляПострадавших</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрощенныйЗачетФиксированныхВзносов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ОбработкиНалоговИОтчетности/Forms/ДекларацияПоУСН/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ШиринаКнопкиОтправить;

&НаКлиенте
Перем КонтекстЭДОКлиент Экспорт;

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		Иначе
			Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Организация = Справочники.Организации.ПредопределеннаяОрганизация();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СобытиеКалендаря) Тогда
		Объект.СобытиеКалендаря = Параметры.СобытиеКалендаря;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СостояниеСобытия) Тогда
		Если ЗначениеЗаполнено(Параметры.СостояниеСобытия) Тогда
			Объект.СостояниеСобытия = Параметры.СостояниеСобытия;
		Иначе
			Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
				Объект.Организация,
				Объект.СобытиеКалендаря);
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОтчетности) Тогда
		Если ЗначениеЗаполнено(Параметры.ДокументОтчетности) Тогда
			ДокументОтчетности = Параметры.ДокументОтчетности;
		Иначе
			ДокументОтчетности = РегламентированнаяОтчетностьУСН.ПолучитьДокументРегламентированнойОтчетностиПоСобытиюКалендаря(Объект.Организация, Объект.СобытиеКалендаря);
		КонецЕсли;
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьПереопределяемый.ДоступнаОтправкаРегламентированногоОтчета() Тогда
		ТекущийСпособСдачи = 1;
	Иначе
		Элементы.ОтправитьОтчетностьЧерезИнтернетВыбор.Видимость = Ложь;
		ТекущийСпособСдачи = 2;
	КонецЕсли;
	
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
	// Обработка ситуации, если статус отправки "отправлен", то проверяем, нет ли каких-нибудь изменений
	Если Объект.СостояниеСобытия = Перечисления.СостоянияСобытийКалендаря.ПолучитьПодтверждение Тогда
		
		РегламентированнаяОтчетностьУСН.ОбновитьСтатусыОтправленныхОтчетов();
		
		Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
				Объект.Организация,
				Объект.СобытиеКалендаря);
	КонецЕсли;
	
	ДатаСменыСостояния = КалендарьОтчетности.ПолучитьДатуСменыСостояния(Объект.Организация, Объект.СобытиеКалендаря);
	
	Заголовок = Объект.СобытиеКалендаря.Наименование;
	
	ИспользуетсяДКО = Истина;
	
	Если РаботаВМоделиСервиса.ЭтоДемонстрационнаяИнформационнаяБаза() Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (в демо не доступно)'");
		Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь
	Иначе	
		ПроверитьВозможностьОтправки();
	КонецЕсли;
	
	ДатыСобытия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СобытиеКалендаря, "ДатаНачалаДокументов,ДатаОкончанияДокументов");
	ПериодЗадачиПредставление = ПредставлениеПериода(
		ДатыСобытия.ДатаНачалаДокументов,
		КонецДня(ДатыСобытия.ДатаОкончанияДокументов),
		"ФП=Истина");
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДокументОтчетности,
			"ДатаНачала,ДатаОкончания,ВыбраннаяФорма");
		
	
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтаФорма, "ФНС");
	НалоговыйПериодПропущен = РегламентированнаяОтчетностьУСН.НалоговыйПериодПропущен(Объект.Организация,
	ДатыСобытия.ДатаОкончанияДокументов, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ДатаРегистрации"));
	
	ПолучитьДанныеОтчетности();
	
	ПериодСобытия = Объект.СобытиеКалендаря.ДатаОкончанияСобытия;
	
	ПлательщикЕНП = РегламентированнаяОтчетностьУСН.ПлательщикЕНП(
	Объект.Организация,
	Объект.СобытиеКалендаря.ДатаОкончанияДокументов);
	
	ЗаписьКалендаряУплата = НайтиЗаписьКалендаряУплата();
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Объект.Организация,Объект.СобытиеКалендаря);
	
	ПодаетсяУведомлениеПоНалогуЗаПериод = Ложь;
	
	ЗаполнитьУведомления();
	УправлениеФормойБлокУведомление();	
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";   
	
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
		"ru = 'Задача подготовки и сдачи ""Декларации по УСН"" выполнена успешно. 
		|При необходимости ее можно найти в архиве (Календарь налогов и отчетности - группа ""Архив"").
		|Декларация по УСН подается в налоговую один раз в год по окончанию налогового периода. 
		|Организации подают декларацию до 31 марта, индивидуальные предприниматели - до 30 апреля'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";   
	
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
		"ru = 'Организация зарегистрирована в декабре. 
		|Сдавать декларацию за текущий налоговый период не требуется.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена2.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
		"ru = 'Декларация отправлена по электронным каналам связи. 
        |Налоговая теперь должна ее проверить.
		|Если будут выявлены ошибки, в календаре налогов и отчетности появится соответствующее уведомление.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ПараметрыВажногоСообщения.ПараметрыДействия = Новый Массив;
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Проверить наличие подтверждения'");
	Действие.ИмяКоманды = "ОбновитьСтатус";
	Действие.Обработчик = "ОбновитьСтатус";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'История обмена'");
	Действие.ИмяКоманды = "ИсторияОбмена";
	Действие.Обработчик = "ИсторияОбмена";
	ПараметрыВажногоСообщения.ПараметрыДействия.Добавить(Действие);
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерОжидатьПодтверждения.Имя);
	
	 
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Ошибка";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
		"ru = 'Декларация не принята. Причины ошибок представлены ниже. Исправьте указанные ошибки и попробуйте отправить декларацию заново.'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок; 
	Действие = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
	Действие.Заголовок = НСтр("ru = 'Причины отказа, ошибки, комментарии'");
	Действие.ИмяКоманды = "ОшибкиСдачи";
	Действие.Обработчик = "ОшибкиСдачи";
	ПараметрыВажногоСообщения.ПараметрыДействия = Действие;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерОзнакомится.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Успех";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
		"ru = 'Декларация по УСН успешно принята в налоговой. Для завершения задачи нажмите кнопку ""Готово"".'");
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	ПараметрыВажногоСообщения.КраткоеПредставление = Заголовок;
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерЗадачаВыполнена1.Имя);
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ПараметрыВажногоСообщения.Сообщение = НСтр(                                                                                
		"ru = 'Для отправки отчетности онлайн необходимо заполнить заявление на подключение к 1С-Отчетности.'");
	ПараметрыВажногоСообщения.КраткоеПредставление = "Отсутствует заявление на подключение к 1С-Отчетности";
	ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения(); 
	ПараметрыДействия.ИмяКоманды = "ОформитьЗаявку";
	ПараметрыДействия.Обработчик = "ОформитьЗаявку";
	ПараметрыДействия.Заголовок  = "Подключить 1С-Отчетность";
	ПараметрыВажногоСообщения.ПараметрыДействия = ПараметрыДействия;

	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения, Элементы.БаннерПодключитьОтчетнность.Имя);
			
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
		
КонецПроцедуры 

Функция НайтиЗаписьКалендаряУплата()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КалендарьПодготовкиОтчетности КАК КалендарьПодготовкиОтчетности
	|		ПО ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = КалендарьПодготовкиОтчетности.Ссылка
	|ГДЕ
	|	ЗаписиКалендаряПодготовкиОтчетности.Организация = &Организация
	|	И НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления
	|	И КалендарьПодготовкиОтчетности.Задача = &Задача
	|	И КалендарьПодготовкиОтчетности.ДатаНачалаСобытия = &ДатаНачалаСобытия");
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Задача", Справочники.ЗадачиКалендаряПодготовкиОтчетности.ЕдиныйНалог); 
	Запрос.УстановитьПараметр("ДатаНачалаСобытия", Объект.СобытиеКалендаря.ДатаНачалаСобытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеОтчетности()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗначенияПоказателейОтчетности.ЗначениеПоказателя КАК ЗначениеПоказателя,
	|	ЗначенияПоказателейОтчетности.ПоказательОтчетности.Код КАК КодОтчетности
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетности КАК ЗначенияПоказателейОтчетности
	|ГДЕ
	|	ЗначенияПоказателейОтчетности.Организация = &Организация
	|	И ЗначенияПоказателейОтчетности.ПериодОтчетности = &ПериодОтчетности
	|	И ЗначенияПоказателейОтчетности.ПоказательОтчетности В(&МассивПоказателей)");
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодОтчетности", Объект.СобытиеКалендаря.ДатаДокументаОбработкиСобытия);
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(ПланыВидовХарактеристик.ПоказателиОтчетности.ВсегоКУплатеЕН);
	
	Запрос.УстановитьПараметр("МассивПоказателей", МассивПоказателей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КодОтчетности = "ВсегоКУплатеЕН" Тогда
			ВсегоКУплате = Выборка.ЗначениеПоказателя;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюЗакладку(ЭтотОбъект, Объект);

	УстановитьЗаголовокФормыПоТекущейСтранице();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииПослеПолученияКонтекста", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения); 
	
	УправлениеКоманднойПанелиФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеПолученияКонтекста(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрикрепленаДоверенность" И Параметр = Объект.Организация Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Идет проверка доверенности'");
	ИначеЕсли ИмяСобытия = "ИзмененаЗаявкаЭДО" Тогда
		Если Параметр.Организация = Объект.Организация Тогда
			Если Параметр.ЕстьАктуальнаяЗаявка Тогда
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'");
				Элементы.ОтправитьВКонтролирующийОрган.Доступность = Истина;
				Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
			Иначе
				Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
				Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
				Элементы.БаннерПодключитьОтчетнность.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаТекущаяОрганизация" Тогда
		Если Окно.Основное Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("e1cib/navigationpoint/НалогиИОтчетность");
		Иначе
			Закрыть();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзменениеСостоянияСобытияКалендаря" Тогда
		Если Параметр = Объект.СобытиеКалендаря
				И Источник <> ЭтаФорма
				И Окно<> Неопределено
				И Не Окно.Основное Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СозданоЗаявлениеНаПодключениеКЭДОСКО" Тогда
		ПроверитьВозможностьОтправки();
	КонецЕсли;
	
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтправитьОтчетностьЧерезИнтернетВыбор(Команда)
	
	Если ТекущийСпособСдачи = 2 Тогда
		ПереключитьСпособСдачи(1);
	Иначе
		ШиринаКнопкиОтправить = 5;
		ПодключитьОбработчикОжидания("АнимацияОтправить", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодатьОтчетностьСамостоятельно(Команда)
	
	Если ТекущийСпособСдачи = 1 Тогда
		ПереключитьСпособСдачи(2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлВыгрузки(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.СохранитьФайлВыгрузкиОтчетности(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьДекларацию(Команда)
	
	РегламентированнаяОтчетностьУСНКлиент.РаспечататьМашиночитаемыйРегламентированныйОтчет(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиСдачи(Команда)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПоказатьПротоколОтправки(ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаявку(Команда)
	
	ОткрытьФорму("Обработка.ДокументооборотСКонтролирующимиОрганами.Форма.МастерФормированияЗаявкиНаПодключениеУпрощенное",
		Новый Структура("Организация", Объект.Организация),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	
	ВыбранныеОрганизации = Новый Массив(1);
	ВыбранныеОрганизации[0] = Объект.Организация;	
	
	
	Если ВыбранныеОрганизации.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Учетная запись не выбрана.");
		Возврат;
	ИначеЕсли ВыбранныеОрганизации.Количество() = 1 Тогда
		ТекстВопроса = НСтр("ru='Информация будет запрошена по всем отчетам, ожидающим подтверждения'");
	Иначе
		ТекстВопроса = "Произвести обмен сообщениями по выбранным учетным записям?";
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстВопроса);
	
	
	// получаем массив учетных записей по массиву организаций
	ВыбранныеУчетныеЗаписи = ПолучитьМассивУчетныхЗаписей(ВыбранныеОрганизации);
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОбменаПоУчетнойЗаписиЗавершение", ЭтотОбъект);
	
	// последовательно для каждой учетной записи производим обмен
	Для Каждого ВыбраннаяУчетнаяЗапись Из ВыбранныеУчетныеЗаписи Цикл
		КонтекстЭДОКлиент.ОсуществитьОбменПоУчетнойЗаписи(ОписаниеОповещения, ВыбраннаяУчетнаяЗапись);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаявлениеОтправленоОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОбновитьСтатус" Тогда
		Оповещение = Новый ОписаниеОповещения("ОбновлениеСтатусаЗавершение", ЭтотОбъект);
		КонтекстЭДОКлиент.ОбновитьСтатусыЗаявленийАбонентов_ИзФормыСписка(, УникальныйИдентификатор, Оповещение,Объект.Организация);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиКСпискуЗаявлений" Тогда
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуСпискаЗаявленийНаПодключение(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбменаПоУчетнойЗаписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьСтатусОтчета(); 
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

	
&НаСервере
Процедура ПроверитьСтатусОтчета()
	
	РегламентированнаяОтчетностьУСН.ОбновитьСтатусыОтправленныхОтчетов();
	
	Объект.СостояниеСобытия = КалендарьОтчетности.ПолучитьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря);
	
	УстановитьТекущуюЗакладку(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивУчетныхЗаписей(ВыбранныеОрганизации)
	
	// получаем массив учетных записей по массиву организаций
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Возврат КонтекстЭДО.УчетныеЗаписиПоОрганизациям(ВыбранныеОрганизации);
	
КонецФункции


&НаКлиенте
Процедура ИсторияОбмена(Команда)
	ПоказатьЗначение(,ПолучитьЦиклОбмена(ДокументОтчетности));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦиклОбмена(Док) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦиклыОбмена.Ссылка
	|ИЗ
	|	Справочник.ЦиклыОбмена КАК ЦиклыОбмена
	|ГДЕ
	|	ЦиклыОбмена.Предмет = &ДокРО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦиклыОбмена.ДатаСоздания УБЫВ");
	Запрос.УстановитьПараметр("ДокРО", Док);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции



// -----------------------------------------------------------------------------
// События переходов

&НаКлиенте
Процедура ПереходЗаполнение(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Заполнить");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		Объект.СостояниеСобытия,
		"");
	
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	ПараметрыФормы = Новый Структура("Организация,СобытиеКалендаря", Объект.Организация,Объект.СобытиеКалендаря);
	
	КалендарьОтчетностиКлиентУНФ.ОткрытьФормуНачалаЗаполнения(ЭтаФорма,ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходДекларацияПоУСН(Команда)
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить");
	
	ЗафиксироватьПереходкОтправке(Объект.Организация, Объект.СобытиеКалендаря, Объект.СостояниеСобытия);
	
	ДатаСменыСостояния = ТекущаяДата();
	
	Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ДекларацияПоУСН;
    ПереключитьСпособСдачи(ТекущийСпособСдачи);

	УстановитьЗаголовокФормыПоТекущейСтранице();
	УправлениеКоманднойПанелиФормы();
	
	Оповестить("ИзменениеСостоянияСобытияКалендаря", Объект.СобытиеКалендаря, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьПереходкОтправке(Организация, Событие, Состояние)
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Организация,
		Событие,
		Состояние,
		"");
	
	
	ЗаписьКалендаря = Справочники.ЗаписиКалендаряПодготовкиОтчетности.ПолучитьЗаписьКалендаря(Организация, Событие);
	Если ЗаписьКалендаря <> Неопределено Тогда
		ОбъектЗаписьКалендаря = ЗаписьКалендаря.ПолучитьОбъект();
		ОбъектЗаписьКалендаря.Завершено = Ложь;
		ОбъектЗаписьКалендаря.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходВыполнил(Команда)
	оп  = Новый ОписаниеОповещения("ОповещениеПриемаДекларации", ЭтотОбъект);

	ПоказатьВопрос(оп, НСтр("ru='ИФНС приняла декларацию?'"), РежимДиалогаВопрос.ДаНет);
	Возврат;
	
КонецПроцедуры


&НаКлиенте
Процедура ОповещениеПриемаДекларации(Ответ, Параметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");
		
		КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
			Объект.Организация,
			Объект.СобытиеКалендаря,
			"");
			
		ДатаСменыСостояния = ТекущаяДата();
		
		Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ЗадачаВыполнена;
		УстановитьЗаголовокФормыПоТекущейСтранице(); 
		УправлениеКоманднойПанелиФормы();
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
		Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДекларацию(Команда)
	
	ПоказатьЗначение(,ДокументОтчетности);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетность(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОЗаполнении",
		ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения,
		НСтр("ru='Вы подтверждаете, что Декларация заполнена полностью и корректно?'"), РежимДиалогаВопрос.ДаНет); 
		
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОЗаполнении(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		// регистрируем заявку на отправку
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаВКонтролирующийОрганПослеОтправки", ЭтотОбъект);
		Если ИспользуетсяДКО Тогда
			КонтекстЭДОКлиент.ОтправкаРегламентированногоОтчетаВФНС(ДокументОтчетности, ОписаниеОповещения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеДекларацияЗаполнена(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		// регистрируем заявку на отправку
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаВКонтролирующийОрганПослеОтправки", ЭтотОбъект);
		
		Если ИспользуетсяДКО Тогда
			КонтекстЭДОКлиент.ОтправкаРегламентированногоОтчетаВФНС(ДокументОтчетности, ОписаниеОповещения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаВКонтролирующийОрганПослеОтправки(РезультатОтправки, ДополнительныеПараметры) Экспорт
	
	Если РезультатОтправки Тогда
		ОтправитьОтчетностьНаСервере();
		Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ЗадачаОжидатьПодтверждения;
		УстановитьЗаголовокФормыПоТекущейСтранице();
	КонецЕсли;
	
	УправлениеКоманднойПанелиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОписаниеРазеделовНажатие(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИзМакета", Истина);
	ПараметрыФормы.Вставить("ПутьДоМакета", "Обработка.ОбработкиНалоговИОтчетности");
	ПараметрыФормы.Вставить("ИмяМакета","ОписаниеПорядкаЗаполненияДекларацииПоУСН");
	ПараметрыФормы.Вставить("Заголовок",НСтр("ru='Декларация по УСН'"));
	
	ОткрытьФорму("ОбщаяФорма.ПроизвольныйHTMLТекст", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСтатусаЗавершение(Результат, ДопПараметры) Экспорт
	ПроверитьВозможностьОтправки();
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено");
	
	КалендарьОтчетности.ЗавершитьСобытиеКалендаряОтчетности(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		"");
		
		
	ДатаСменыСостояния = ТекущаяДата();
	
	Элементы.СтраницаДекларация.ТекущаяСтраница = Элементы.ЗадачаВыполнена;
	УстановитьЗаголовокФормыПоТекущейСтранице();     
	УправлениеКоманднойПанелиФормы();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ЗаписиКалендаряПодготовкиОтчетности"));
	Оповестить("Запись_ЗаписиКалендаряПодготовкиОтчетности");
КонецПроцедуры

// Конец событий переходов
// -----------------------------------------------------------------------------

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПроверитьВозможностьОтправки()
	
	Если НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "УчетнаяЗаписьОбмена")) Тогда
		// Возможно заявление отправлено, но еще не одобрено
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеАбонентаСпецоператораСвязи.Ссылка
		|ИЗ
		|	Документ.ЗаявлениеАбонентаСпецоператораСвязи КАК ЗаявлениеАбонентаСпецоператораСвязи
		|ГДЕ
		|	НЕ ЗаявлениеАбонентаСпецоператораСвязи.ПометкаУдаления
		|	И ЗаявлениеАбонентаСпецоператораСвязи.Организация = &Организация
		|	И ЗаявлениеАбонентаСпецоператораСвязи.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отправлено)";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Если Запрос.Выполнить().Пустой() Тогда
			Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
			Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
			Элементы.БаннерПодключитьОтчетнность.Видимость = Истина;
			Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Ложь;
		Иначе
			
			Элементы.ОтправитьВКонтролирующийОрган.Доступность = Ложь;
			Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить (нет заявки)'");
			Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
			Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ОтправитьВКонтролирующийОрган.Заголовок = НСтр("ru='Отправить'");
		Элементы.ОтправитьВКонтролирующийОрган.Доступность = Истина;
		Элементы.БаннерПодключитьОтчетнность.Видимость = Ложь;
		Элементы.ДекорацияЗаявлениеОтправлено.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьОтчетностьНаСервере()
	
	Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ПолучитьПодтверждение");
	
	КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
		Объект.Организация,
		Объект.СобытиеКалендаря,
		Объект.СостояниеСобытия,
		ДокументОтчетности);
		
	ДатаСменыСостояния = ТекущаяДатаСеанса();
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормыПоТекущейСтранице()
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Элементы.СтраницаДекларация.ТекущаяСтраница.Заголовок, ПериодЗадачиПредставление);
	РегламентированнаяОтчетностьУСНКлиентСервер.УстановитьЗаголовокФормыЗадачи(ЭтаФорма, Объект.Организация);
	
КонецПроцедуры


// 1 - через представителя; 2 - самостоятельно
&НаСервере
Процедура ПереключитьСпособСдачи(СпособСдачи)
	
	Если НЕ РегламентированнаяОтчетностьПереопределяемый.ДоступнаОтправкаРегламентированногоОтчета() Тогда
		СпособСдачи = 2;
	КонецЕсли;
	
	Если СпособСдачи = 1 Тогда 
		Элементы.ПереходВыполнил.Видимость = Ложь;   
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Истина; 
		Элементы.ОтправитьВКонтролирующийОрган.КнопкаПоУмолчанию = Истина; 
		Элементы.ОтправитьВКонтролирующийОрган.Важность = ВажностьКнопки.Главная;


		Элементы.ГруппаПодачиЧерезИнтернетОписание.Видимость = Истина;
		Элементы.ГруппаПодачиСамостоятельноОписание.Видимость = Ложь;
	Иначе
	    Элементы.ПереходВыполнил.Видимость = Истина;    
		Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина;      
		Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		Элементы.ОтправитьВКонтролирующийОрган.Видимость = Ложь;

		Элементы.ГруппаПодачиЧерезИнтернетОписание.Видимость = Ложь;
		Элементы.ГруппаПодачиСамостоятельноОписание.Видимость = Истина;
	КонецЕсли;
	
	Если ТекущийСпособСдачи = СпособСдачи Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийСпособСдачи = СпособСдачи;	
КонецПроцедуры

&НаКлиенте
Процедура АнимацияОтправить()
	
	Если ШиринаКнопкиОтправить <= 25 Тогда
		Элементы.ОтправитьВКонтролирующийОрган.Ширина = ШиринаКнопкиОтправить;
		ПодключитьОбработчикОжидания("АнимацияОтправить", 0.2, Истина);
		ШиринаКнопкиОтправить = ШиринаКнопкиОтправить + 5;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюЗакладку(ЭтаФорма, Объект)
	
	Если Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ОтчетНеСдан") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаОзнакомиться;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Распечатать")
		ИЛИ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить")
		ИЛИ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Ознакомиться") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ДекларацияПоУСН;
		Если НЕ Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Отправить") Тогда
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		Иначе
		ЭтаФорма.Элементы.ОтправитьВКонтролирующийОрган.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.ОтправитьВКонтролирующийОрган.Важность = ВажностьКнопки.Главная;
	    КонецЕсли;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Ложь; 
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Обычная;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершить") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаПроверена;
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Ложь;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Главная;
		
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.Завершено") Тогда
		Если ЭтаФорма.НалоговыйПериодПропущен Тогда
			ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаВыполненаБезДекларации;
		Иначе
			ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаВыполнена;
		КонецЕсли;   
		ЭтаФорма.Элементы.Закрыть.КнопкаПоУмолчанию = Истина; 
		ЭтаФорма.Элементы.Закрыть.Важность = ВажностьКнопки.Главная;
	ИначеЕсли Объект.СостояниеСобытия = ПредопределенноеЗначение("Перечисление.СостоянияСобытийКалендаря.ПолучитьПодтверждение") Тогда
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ЗадачаОжидатьПодтверждения;
		
	Иначе
		
		ЭтаФорма.Элементы.СтраницаДекларация.ТекущаяСтраница = ЭтаФорма.Элементы.ДекларацияПоУСН;
		ЭтаФорма.Элементы.ПереходВыполнил.КнопкаПоУмолчанию = Истина;
		ЭтаФорма.Элементы.Далее.КнопкаПоУмолчанию = Ложь;
		ЭтаФорма.Элементы.ПереходВыполнил.Важность = ВажностьКнопки.Главная;
		ЭтаФорма.Элементы.Далее.Важность = ВажностьКнопки.Обычная;
		
	КонецЕсли;

	
КонецПроцедуры


#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСпособСдачиПриИзменении(Элемент)
	
	ПереключитьСпособСдачи(ТекущийСпособСдачи);
	
КонецПроцедуры

#КонецОбласти

#Область Уведомления
// -----------------------------------------------------------------------------
// Уведомления

&НаКлиенте
Процедура ВыполнитьДействиеСформироватьУведомление(Команда)
	
	ОткрытьДокументОповещение = Новый ОписаниеОповещения("ОбработатьРедактированиеУведомления", ЭтотОбъект);
	
	ПараметрыУведомления = Новый Структура;
	ПараметрыУведомления.Вставить("Организация",                 Объект.Организация);
	ПараметрыУведомления.Вставить("ЗаписьКалендаря",                     ЗаписьКалендаря);
	ПараметрыУведомления.Вставить("ПериодСобытия",               ПериодСобытия);
	ПараметрыУведомления.Вставить("АдресХранилищаТаблицыНалоги", ОписаниеТаблицыНалоги());
	ПараметрыУведомления.Вставить("КонтекстныйВызов",            Истина);
	
	ОткрытьФорму("Документ.УведомлениеОбИсчисленныхСуммахНалогов.Форма.ФормаДокумента",
		ПараметрыУведомления,
		ЭтотОбъект,
		,
		,
		,
		ОткрытьДокументОповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  
	
&НаКлиенте
Процедура ВыполнитьДействиеСформироватьОперациюПоЕНС(Команда)
	
	ВыполненоВТихомРежиме = Ложь;
	СформироватьОперациюПоЕНСВТихомРежиме(ВыполненоВТихомРежиме);
	Если ВыполненоВТихомРежиме Тогда
		// Только перерисуем форму
		ОбработатьРедактированиеУведомления();
		Возврат;
	КонецЕсли;
	
	ОткрытьДокументОповещение = Новый ОписаниеОповещения("ОбработатьРедактированиеУведомления", ЭтотОбъект);
	
	ПараметрыУведомления = Новый Структура;
	ПараметрыУведомления.Вставить("Организация",                 Объект.Организация);
	ПараметрыУведомления.Вставить("ЗаписьКалендаря",                     ЗаписьКалендаря);
	ПараметрыУведомления.Вставить("ПериодСобытия",               ПериодСобытия);
	ПараметрыУведомления.Вставить("АдресХранилищаТаблицыНалоги", ОписаниеТаблицыНалоги());
	ПараметрыУведомления.Вставить("КонтекстныйВызов",            Истина);
	
	ОткрытьФорму("Документ.ОперацияПоЕдиномуНалоговомуСчету.Форма.ФормаДокумента",
		ПараметрыУведомления,
		ЭтотОбъект,
		,
		,
		,
		ОткрытьДокументОповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОперациюПоЕНСВТихомРежиме(ВыполненоВТихомРежиме)
	
	ЕдиныйНалоговыйСчет.СформироватьОперациюПоЕНСВТихомРежиме(Объект.Организация,
		ОписаниеТаблицыНалоги(),
		ЗаписьКалендаря,
		ПериодСобытия,
		ВыполненоВТихомРежиме);
	
КонецПроцедуры
	
&НаСервере
Функция ОписаниеТаблицыНалоги()
	
	ТаблицаНалоги = ТаблицаНалогиДляУведомления();
		
	ТаблицыНалогов = Документы.УведомлениеОбИсчисленныхСуммахНалогов.ОписаниеТаблицНалогов();
	ТаблицыНалогов.ТаблицаНалоги = ТаблицаНалоги;
	
	АдресХранилищаТаблицыНалоги = ПоместитьВоВременноеХранилище(ТаблицыНалогов, УникальныйИдентификатор);
	
	Возврат АдресХранилищаТаблицыНалоги;
	
КонецФункции 

&НаСервере
Функция ТаблицаНалогиДляУведомления() Экспорт
	
	ТаблицаНалоги = Документы.УведомлениеОбИсчисленныхСуммахНалогов.ОписаниеТаблицыНалогов();
	
	ОбъектНалогообложения = РегламентированнаяОтчетностьУСН.ОбъектНалогообложенияНаДату(Объект.Организация,Объект.СобытиеКалендаря);
	Если ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.ДоходыМинусРасходы Тогда
		ВидВзаиморасчетов = Справочники.ВидыНалогов.ЕдиныйНалогПриУСНРасходы;
	Иначе
		ВидВзаиморасчетов = Справочники.ВидыНалогов.ЕдиныйНалогПриУСН;
	КонецЕсли;
	
	Если ВсегоКУплате > 0 Тогда 
		
		НоваяСтрока = ТаблицаНалоги.Добавить();
		НоваяСтрока.РегистрацияВНалоговомОргане = Объект.Организация.РегистрацияВНалоговомОргане;
		НоваяСтрока.КодПоОКТМО                  = НоваяСтрока.РегистрацияВНалоговомОргане.КодПоОКТМО;
		НоваяСтрока.Налог                       = ВидВзаиморасчетов;
		НоваяСтрока.КодБК                       = Справочники.ВидыНалогов.КБК(НоваяСтрока.Налог,, Объект.СобытиеКалендаря.ДатаОкончанияСобытия);
		НоваяСтрока.СчетУчета                   = НоваяСтрока.Налог.СчетУчета;
		НоваяСтрока.Сумма = ВсегоКУплате;
		НоваяСтрока.СрокУплаты                  = РегламентированнаяОтчетностьУСН.ОпределитьСрокПлатежаПоЕНП(Объект.СобытиеКалендаря.ДатаОкончанияСобытия);
		
	КонецЕсли;
	
	Возврат ТаблицаНалоги;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРедактированиеУведомления(РезультатЗакрытия = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьСведенияОбУведомлениях();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияОбУведомлениях()
	
	Если Не ПлательщикЕНП Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУведомления();
	
	УправлениеФормойБлокУведомление();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьУведомления()
	
	ТаблицаУведомления = ЕдиныйНалоговыйСчет.ДанныеДляУведомлений(ЗаписьКалендаря, Объект.Организация, ПериодСобытия);
	УведомленияОбИсчисленныхНалогах.Загрузить(ТаблицаУведомления);
	
	УведомлениеОбИсчисленныхНалогахПодготовлено = УведомленияОбИсчисленныхНалогах.Количество() > 0;
	
КонецПроцедуры 

&НаКлиенте
Процедура УведомлениеНажатие(Команда)
	
	// Команды генерируются в КопироватьЭлементСПодчиненными() и содержат числовой идентификатор,
	// совпадающий с идентификаторами строк в списке Платежи
	Идентификатор = ЕдиныйНалоговыйСчетКлиент.Идентификатор(Команда.Имя);
	Если Идентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьУведомление(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУведомление(Идентификатор)
	
	ОткрытьДокументОповещение = Новый ОписаниеОповещения("ОбработатьРедактированиеУведомления", ЭтотОбъект);
	
	ПараметрыФормыУведомления = ПараметрыФормыУведомления(Идентификатор);
	
	Если ПодаетсяУведомлениеПоНалогуЗаПериод Тогда
		ИмяОбъекта = "УведомлениеОбИсчисленныхСуммахНалогов";
	Иначе
		ИмяОбъекта = "ОперацияПоЕдиномуНалоговомуСчету";
	КонецЕсли;
	
	ОткрытьФорму("Документ." + ИмяОбъекта + ".ФормаОбъекта",
		ПараметрыФормыУведомления,
		ЭтотОбъект,
		,
		,
		,
		ОткрытьДокументОповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУведомленияПоСтроке(СтрокаУведомления)
	
	Если ЗначениеЗаполнено(СтрокаУведомления.Уведомление) Тогда
		Возврат Новый Структура("Ключ", СтрокаУведомления.Уведомление);
	Иначе
		Возврат ПараметрыФормыПустогоУведомления();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПараметрыФормыПустогоУведомления()
	
	ЗначенияЗаполнения = Новый Структура("Организация", Объект.Организация);
	
	Возврат Новый Структура("ЗначенияЗаполнения, ПериодСобытия, ЗаписьКалендаря",
	ЗначенияЗаполнения, Объект.ПериодРегистрации, ЗаписьКалендаря);
	
КонецФункции

&НаСервере
Функция ПараметрыФормыУведомления(Идентификатор)
	
	Если Идентификатор = Неопределено Тогда 
		// Получим параметры формы для пустого документа
		Возврат ПараметрыФормыПустогоУведомления();
	КонецЕсли;
	
	СтрокаУведомления = УведомленияОбИсчисленныхНалогах.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаУведомления = Неопределено Тогда
		Возврат ПараметрыФормыПустогоУведомления();
	КонецЕсли;
	
	Возврат ПараметрыФормыУведомленияПоСтроке(СтрокаУведомления);
	
КонецФункции

&НаКлиенте
Процедура УправлениеКоманднойПанелиФормы()	
	
	ИмяСтраницы = Элементы.СтраницаДекларация.ТекущаяСтраница.Имя;
	
	Если ИмяСтраницы = "ДекларацияПоУСН" Тогда
		Элементы.НавигацияНачало.Видимость = Истина;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
		Элементы.НавигацияЗадачаБезДекларации.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаВыполнена" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Истина;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
		Элементы.НавигацияЗадачаБезДекларации.Видимость = Ложь;
		
		Элементы.Закрыть.КнопкаПоУмолчанию = Истина;
		Элементы.Закрыть.Важность = ВажностьКнопки.Главная;
		
	ИначеЕсли ИмяСтраницы = "ЗадачаОзнакомиться" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Истина;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
		Элементы.НавигацияЗадачаБезДекларации.Видимость = Ложь;
	ИначеЕсли ИмяСтраницы = "ЗадачаПроверена" Тогда
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Истина;
		Элементы.НавигацияЗадачаБезДекларации.Видимость = Ложь;
		
		Элементы.Далее.КнопкаПоУмолчанию = Истина;
		Элементы.Далее.Важность = ВажностьКнопки.Главная;

		
	ИначеЕсли ИмяСтраницы = "ЗадачаВыполненаБезДекларации" Тогда
	    Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь; 
        Элементы.НавигацияЗадачаБезДекларации.Видимость = Истина;
		
		Элементы.Закрыть2.КнопкаПоУмолчанию = Истина;
		Элементы.Закрыть2.Важность = ВажностьКнопки.Главная;

	Иначе
		Элементы.НавигацияНачало.Видимость = Ложь;   
		Элементы.НавигацияОкончание.Видимость = Ложь;
		Элементы.НавигацияОзнакомится.Видимость = Ложь;   
		Элементы.НавигацияЗадачаПроверена.Видимость = Ложь;
		Элементы.НавигацияЗадачаБезДекларации.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормойБлокУведомление()
	
	ЕдиныйНалоговыйСчет.УправлениеФормойБлокУведомление(ЭтотОбъект,
		ВсегоКУплате > 0, , 2);
	
КонецПроцедуры

#КонецОбласти
